WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/tests/hcom_nx_qspi_flash_tests.c
  syslog(2, "Bulk erase #2 of %lu completed.\n", _flash_test_total_write_pages);
  syslog(2, "Write all %lu pages then verify them.\n", _flash_test_total_write_pages);
  usleep(10);

  // Verify 100% erased
  syslog(2, "Verifying %lu pages erased again.\n", _flash_test_total_write_pages);
  ret = hcom_exec_flash_test_find_display_used_pages(false, false);
  if(ret < 0)
  {
    syslog(2, "%s@%d-ERROR in %s(). Verifying erased pages - ret:%d\n",
              thisFile, __LINE__, __func__, ret);
    return ret;
  }
  usleep(10);

  // Fill the entire QSPI flash with data
  for(pageOff = 0; pageOff < _flash_test_total_write_pages; pageOff++)
  {
    hcom_exec_flash_populate_buffer_user_pat(0xaa, pageBuffer);

    if(pageOff % FLASH_TEST_DISPLAY_INTERVAL == 0)
    {
      syslog(2, "INFO-Writing to page %d of %d\n", pageOff, _flash_test_total_write_pages);
      usleep(10);
    }

    nwrite = MTD_BWRITE(_test_mtd, pageOff, 1, pageBuffer);
    if(nwrite != 1)
    {
      syslog(2, "%s@%d-ERROR in %s() - nwrite:%d\n", thisFile, __LINE__, __func__, nwrite);
      return ret;
    }
  }

  syslog(2, "Data written. Verifying %d pages again\n", _flash_test_total_write_pages);
  
  // Now read and test that the entire qspi flash is correct
  for(pageOff = 0; pageOff < _flash_test_total_write_pages; pageOff++)
  {
    if(pageOff % FLASH_TEST_DISPLAY_INTERVAL == 0)
    {
      syslog(2, "INFO-Verifying page %d of %d\n", pageOff, _flash_test_total_write_pages);
      usleep(10);
    }

    nread = MTD_BREAD(_test_mtd, pageOff, 1, pageBuffer);
    if(nread != 1)
    {
      syslog(2, "%s@%d-ERROR in %s() - nread:%d\n", thisFile, __LINE__, __func__, nread);
      return ret;
    }

    if(!hcom_exec_flash_verify_buffered_data_2(0xaa, pageOff, pageBuffer))
    {
      if(nfailed == 0)
      {
        syslog(2, "Page %d was first to fail to compare\n", pageOff);
      }
      else
      {
        syslog(2, "Page %d also failed to compare\n", pageOff);
      }
      nfailed++;
    }
  }
  uint64_t testTimeTestEnd = hcom_nx_utils_get_current_time64();

  syslog(2, "Write / read test completed with %d errors\n", nfailed);
  
  char timeTotTest[16];
  hcom_exec_flash_convert_ms_to_time((testTimeTestEnd - testTimeTestStart)/1000000, timeTotTest, 16);

  syslog(2, "Total test time:%s\n", timeTotTest);

  return nfailed == 0 ? OK : nfailed;
}

//=====================================================================
// This test takes years to complete. Nice test but not practical
static int hcom_exec_flash_qspi_comprehensive_test(void)
{
  int ret;
  off_t pageOff;
  int nwrite, nread;
  off_t beforeOff, afterOff;
  int errCount = 0;

  uint8_t pageBuffer[_flash_test_write_page_size];
  uint8_t eraseBuffer[_flash_test_write_page_size];
  memset(eraseBuffer, 0xff, _flash_test_write_page_size);

  syslog(2, "Comprehensive testing %d pages has begun.\n", _flash_test_total_write_pages);
  syslog(2, "This checks that the driver only writes to 1 page and the correct page\n");
  syslog(2, "Bulk erasing QSPI flash (2-3 minutes)\n");

  uint64_t testTimeEraStart = hcom_nx_utils_get_current_time64();
  ret = _test_mtd->ioctl(_test_mtd, MTDIOC_BULKERASE, 0);
  if(ret < 0)
  {
    syslog(2, "%s@%d-ERROR in %s() - ret:%d\n", thisFile, __LINE__, __func__, ret);
    usleep(50 * 1000);
    return ret;
  }

  uint64_t testTimeEraEnd = hcom_nx_utils_get_current_time64();
  syslog(2, "Bulk erase completed\n");
  usleep(10);

  for(pageOff = 0; pageOff < _flash_test_total_write_pages; pageOff++)
  {
    // Write next page
    hcom_exec_flash_populate_buffer(pageOff, pageBuffer);
    nwrite = MTD_BWRITE(_test_mtd, pageOff, 1, pageBuffer);
    if(nwrite != 1)
    {
      syslog(2, "%s@%d-ERROR in %s() - nwrite:%d\n", thisFile, __LINE__, __func__, nwrite);
      usleep(50 * 1000);
      return nwrite;
    }

    // Clear pageBuffer (probably a waste of time...) and read
    memset(pageBuffer, 0x00, _flash_test_write_page_size);
    // And verify that this page has been written correctly
    nread = MTD_BREAD(_test_mtd, pageOff, 1, pageBuffer);
    if(nread != 1)
    {
      syslog(2, "%s@%d-ERROR in %s() - nread:%d\n", thisFile, __LINE__, __func__, nread);
      usleep(50 * 1000);
      return nread;
    }

    if(!hcom_exec_flash_verify_buffered_data(pageOff, pageBuffer))
    {
      syslog(2, "Just written page %d failed to compare\n", pageOff);
    }

    // Next verify that all proceeding and subsequent pages are
    // correct. Those before should have data and those following
    // should be erased (0xff).
    for(beforeOff = 0; beforeOff < pageOff; beforeOff++)
    {
      if(beforeOff % FLASH_TEST_DISPLAY_INTERVAL == 0)
      {
        syslog(2, "INFO-Testing:%d Previous page %d of %d. Errors:%lu\n",
                  pageOff, beforeOff, _flash_test_total_write_pages, errCount);
        usleep(10);
      }

      nread = MTD_BREAD(_test_mtd, beforeOff, 1, pageBuffer);
      if(nread != 1)
      {
        syslog(2, "%s@%d-ERROR in %s() - nread:%d\n", thisFile, __LINE__, __func__, nread);
        usleep(50 * 1000);
        return nread;
      }

      // Check for expected data
      if(!hcom_exec_flash_verify_buffered_data(beforeOff, pageBuffer))
      {
        errCount++;
        syslog(2, "Proceeding page %d failed to compare\n", beforeOff);
      }
    }

    for(afterOff = pageOff + 1; afterOff < _flash_test_total_write_pages; afterOff++)
    {
      if(afterOff % FLASH_TEST_DISPLAY_INTERVAL == 0)
      {
        syslog(2, "INFO-Testing:%d After page %d of %d. Errors:%lu\n",
                  pageOff, afterOff, _flash_test_total_write_pages, errCount);
        usleep(10);
      }

      // Clear pageBuffer (probably a waste of time...) and read
      memset(pageBuffer, 0x00, _flash_test_write_page_size);
      nread = MTD_BREAD(_test_mtd, afterOff, 1, pageBuffer);
      if(nread != 1)
      {
        syslog(2, "%s@%d-ERROR in %s() - nread:%d\n", thisFile, __LINE__, __func__, nread);
        usleep(50 * 1000);
        return nread;
      }

      // Find any non-zero values
      if(memcmp(eraseBuffer, pageBuffer, _flash_test_write_page_size) != 0)
      {
        errCount++;
        syslog(2, "Following page %d failed to compare\n", afterOff);
        usleep(10);
      }
    }
  }

