WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/tests/hcom_nx_qspi_flash_tests.c
  uint64_t testTimeTestEnd = hcom_nx_utils_get_current_time64();

  syslog(2, "Bulk erase took:%llu mSec and testing took:%llu mSec\n",
            (testTimeEraEnd - testTimeEraStart)/1000000,
            (testTimeTestEnd - testTimeEraEnd) /1000000);

  return errCount;
}

//=======================================================================================
static int hcom_exec_flash_test_read_display_1_page(uint32_t pageOffset)
{
  uint8_t pageBuffer[_flash_test_write_page_size];

  syslog(2, "Reading 256 bytes from QSPI flash at page# %d\n", pageOffset);
  int nread = MTD_BREAD(_test_mtd, pageOffset, 1, pageBuffer);
  if(nread != 1)
  {
    syslog(2, "%s@%d-ERROR in %s() - nread:%d\n", thisFile, __LINE__, __func__, nread);
    usleep(50 * 1000);
    return nread;
  }

  syslog(2, "\n--------- data read from page# %d----------\n", pageOffset);
  hcom_nx_diag_print_buffer(pageBuffer, _flash_test_write_page_size, 1);
  return OK;
}

//=======================================================================================
// Erase sectors are 4096 bytes each
static int hcom_exec_flash_fs_flash_test_erase_1_4k_sector(uint32_t sectorOffset)
{
  int ret;

  syslog(2, "Erasing QSPI flash erase sector# %d\n", sectorOffset);
  ret = MTD_ERASE(_test_mtd, sectorOffset, 1);
  if(ret < 0)
  {
    syslog(2, "%s@%d-ERROR in %s() - ret:%d\n", thisFile, __LINE__, __func__, ret);
    usleep(50 * 1000);
    return ret;
  }

  syslog(2, "Sector erase of QSPI flash completed\n");
  return OK;
}

//=======================================================================================
static int hcom_exec_flash_fs_flash_test_erase_entire_flash(void)
{
  int ret;

  syslog(2, "Bulk erasing QSPI flash begun\n");
  usleep(10);

  ret = _test_mtd->ioctl(_test_mtd, MTDIOC_BULKERASE, 0);
  if(ret < 0)
  {
    syslog(2, "%s@%d-ERROR in %s() - ret:%d\n", thisFile, __LINE__, __func__, ret);
    usleep(50 * 1000);
    return ret;
  }

  syslog(2, "Bulk erase of QSPI flash completed\n");
  return OK;
}

//=======================================================================================
// This function is used to test the qspi flash
int hcom_nx_exec_test_qspi_flash_write(struct hcom_nx_cmd_data *cmdData)
{
  uint8_t pageBuffer[_flash_test_write_page_size];
  int userData = (int)cmdData->userData;
  int ret;

  _mtdGeoShown = false;

  ret = hcom_exec_flash_initialize_mtd_for_testing();
  if(ret < 0)
  {
    syslog(2, "%s@%d-ERROR in %s() - ret:%d\n", thisFile, __LINE__, __func__, ret);
    usleep(50 * 1000);
    return ret;
  }

  switch(userData)
  {
    case -1:
      ret = hcom_exec_flash_test_qspi_data_rw(/*verifyPages=*/true);
      break;

    case -2:
      ret = hcom_exec_flash_test_qspi_data_rw(/*verifyPages=*/false);
      break;

    case -3:
      ret = hcom_exec_flash_qspi_comprehensive_test();
      break;

    case -4:
      ret = hcom_exec_flash_test_qspi_data_rw_2();
      break;

    default:
      // Populate the buffer with userData for a page
      hcom_exec_flash_populate_buffer(userData, pageBuffer);

      // Write buffer to requested page
      ret = MTD_BWRITE(_test_mtd, userData, 1, pageBuffer);
      if(ret != 1)    // Check number written
      {
        syslog(2, "%s@%d-ERROR in %s() - number written:%d. Must be 1\n",
                  thisFile, __LINE__, __func__, ret);
        usleep(50 * 1000);
        ret = -1;
      }
      break;
  }

  if(ret < 0)
  {
    syslog(2, "%s@%d-ERROR: Write test with ret:%d (command:%d)\n",
              thisFile, __LINE__, ret, userData);
  }
  else if (ret > 0)
  {
    syslog(2, "%s@%d-Write test reported %d flash write errors (command:%d)\n",
              thisFile, __LINE__, ret, userData);
  }
  else
  {
    syslog(2, "Success-Write test passed 100%% (command:%d)\n", userData);
  }

  return ret;
}

//=======================================================================================
// This function is used to test the qspi flash
int hcom_nx_exec_test_qspi_flash_init(struct hcom_nx_cmd_data *cmdData)
{
  int userData = (int)cmdData->userData;
  int ret;

  _mtdGeoShown = false;

  ret = hcom_exec_flash_initialize_mtd_for_testing();
  if(ret < 0)
  {
    syslog(2, "%s@%d-ERROR in %s() - ret:%d\n", thisFile, __LINE__, __func__, ret);
    usleep(50 * 1000);
    return ret;
  }
  
  switch(userData)
  {
    case -1:
      ret = hcom_exec_flash_fs_flash_test_erase_entire_flash();
      break;

     case -2:
      ret = hcom_exec_flash_fs_flash_test_erase_used_4k_sectors();
      break;

   default:
      ret = hcom_exec_flash_fs_flash_test_erase_1_4k_sector(userData);
      break;
  }
  
  if(ret < 0)
  {
    syslog(2, "%s@%d-Init test command:%d ERROR with ret:%d\n", thisFile, __LINE__, userData, ret);
  }
  else
  {
    syslog(2, "%s@%d-Init test command:%d Succeeded\n", thisFile, __LINE__, userData);
  }
  return ret;
}

//=======================================================================================
// This function is used to test the qspi flash
int hcom_nx_exec_test_qspi_flash_read(struct hcom_nx_cmd_data *cmdData)
{
  int userData = (int)cmdData->userData;
  int ret;

  _mtdGeoShown = false;

  ret = hcom_exec_flash_initialize_mtd_for_testing();
  if(ret < 0)
  {
    syslog(2, "%s@%d-ERROR in %s() - ret:%d\n", thisFile, __LINE__, __func__, ret);
    usleep(50 * 1000);
    return ret;
  }

  switch((int32_t)userData)
  {
    case -1:
      ret = hcom_exec_flash_test_find_display_used_pages(false, false);
      break;

    case -2:
      ret = hcom_exec_flash_test_find_display_erased_pages();
      break;

    default:
      ret = hcom_exec_flash_test_read_display_1_page(userData);
      break;
  }

  if(ret < 0)
  {
    syslog(2, "%s@%d-Read test command:%d ERROR with ret:%d\n", thisFile, __LINE__, userData, ret);
  }
  else
  {
    syslog(2, "%s@%d-Read test command:%d Succeeded\n", thisFile, __LINE__, userData);
  }
  return ret;
}

// //----------------------------------------------------------------------
// // The task is created when the first developer 1 is called. The task calls
// // here and this function calls mono_main. When mono_main returns this task
// // waits for the next developer 1 call and the task is reused.
  
//   // int ret;
//   // syslog(2, "Entered Developer_1 will call into mono_main\n");
//   // int argc = userData;
//   // char *myArgv[1];
//   // myArgv[0] = "dbgTask";

//   // // Now send the requested command    
//   // ret = (*USERSPACE->us_entrypoint)((int)argc, myArgv);
//   // syslog(2, "%s() - dbgTask exited ret = %d\n", __func__, ret);


// void hcom_exec_rqst_testing_developer_1(uint32_t userData)
// {
//   hcom_utils_f7syslog(LOG_WARNING, "%s not implemented\n", __func__);

//   // // This code call using 'hcom thread'
//   // int ret;
//   // syslog(2, "Entered Developer_1 will call into mono_main\n");
//   // int argc = userData;
//   // char *myArgv[1];
//   // myArgv[0] = "dbgTask";

//   // // Now send the requested command    
//   // ret = (*USERSPACE->us_entrypoint)((int)argc, myArgv);
//   // syslog(2, "%s() - dbgTask exited ret = %d\n", __func__, ret);

// // // This call creates a new task each time
// //   DEBUGASSERT(USERSPACE->us_entrypoint != NULL);
// //   int dbg_pid = 0;

// //   char *myArgs[3];
// //   char ArgBuf[16];
// //   snprintf(ArgBuf, 16, "%d", userData);
  
// //   myArgs[0] = ArgBuf;
// //   myArgs[1] = "happy";
// //   myArgs[2] = NULL;
  
// //   dbg_pid = task_create("dbgTask", CONFIG_USERMAIN_PRIORITY,
// //                       CONFIG_USERMAIN_STACKSIZE,
// //                       USERSPACE->us_entrypoint, myArgs);
// // //                      (FAR char * const *)NULL);

// //   syslog(2, "Developer_1 dgb_pid:%d\n", dbg_pid);


//   //memTest = malloc(1024 * userData);
// //  if(memTest == NULL)
// //  {
// //    syslog(LOG_ERR, "%s@%d-malloc returned NULL\n", thisFile, __LINE__);
// //    return -ENOMEM;
// //  }

